const words = [
    [
        "солевой",
        "героиновый",
        "хмурый",
        "прикольный",
        "смешной",
        "юморной",
        "обосраный",
        "маринованый",
        "ванючий",
        "кака",
        "ебейщий",
        "апколатый",
        "вкусный"
    ],
    [
        "камаз",
        "хапуга",
        "котенок",
        "пес",
        "миньён",
        "бегемот",
        "андрюха",
        "компьютер",
        "дристун",
        "пук",
        "насвай",
        "саня",
        "школьник",
        "доебалус",
        "артемка",
        "дрист",
        "ковер",
        "перфоратор",
        "стомеска",
        "бурег кинг",
        "очко",
        "пепси",
        "тубик",
        "алкаш",
        "кетчуп",
        "абобус",
        "руль",
        "программист",
        "монитор",
        "мультиварка",
        "анус",
        "сурикат"
    ],
    [
        "228",
        "1337",
        ":)",
        "XD"
    ]
];

function randomify(arr) {
    return arr[Math.floor(arr.length * Math.random())];
}

function smexota(include_additional = false) {
    let smex = "";

    smex += randomify(words[0]);
    smex += " " + randomify(words[1]);

    if (include_additional) {
        smex += " " + randomify(words[2]);
    }

    return smex;
}

